# Imports

In [54]:
import pandas as pd

# Bible Verse Data

### Load and view file in dataframe

In [55]:
df = pd.read_excel('/Users/owner/Onedrive/Desktop/personal/Data/bible_kjv.xlsx')

df.head(2)

,id,book,chapter,verse,text
0,1001001,1,1,1,In the beginning God created the heaven and th...
1,1001002,1,1,2,"And the earth was without form, and void; and ..."

### View and edit columns

In [56]:
df.columns

Index(['id', 'book', 'chapter', 'verse', 'text'], dtype='object')

In [57]:
rename_columns = {'b':'book',
                 'c':'chapter',
                 'v':'verse',
                 't':'text'}

df.rename(columns = rename_columns, inplace=True)
df.head(2)

,id,book,chapter,verse,text
0,1001001,1,1,1,In the beginning God created the heaven and th...
1,1001002,1,1,2,"And the earth was without form, and void; and ..."

### View and edit datatypes

In [58]:
df.dtypes

id          int64
book        int64
chapter     int64
verse       int64
text       object
dtype: object

In [59]:
df['book']=pd.to_numeric(df['book']).astype(object)
df.dtypes

id          int64
book       object
chapter     int64
verse       int64
text       object
dtype: object

# Books of the Bible Data

### Load and view file in dataframe

In [60]:
df_books = pd.read_excel('/Users/owner/Onedrive/Desktop/personal/Data/bible_books.xlsx')

df_books.head(2)

   book book_name
0     1   Genesis
1     2    Exodus

### View and edit columns

In [61]:
df_books.columns

Index(['book', 'book_name'], dtype='object')

### View and edit datatypes

In [62]:
df_books.dtypes

book          int64
book_name    object
dtype: object

# Merge

### Left-joining Bible Verse Data with Books Data to create complete Bible database

In [63]:
df_bible = pd.merge(df_books, df, on = 'book', how = 'left')
df_bible.head()

,book,book_name,id,chapter,verse,text
0,1,Genesis,1001001,1,1,In the beginning God created the heaven and th...
1,1,Genesis,1001002,1,2,"And the earth was without form, and void; and ..."
2,1,Genesis,1001003,1,3,"And God said, Let there be light: and there wa..."
3,1,Genesis,1001004,1,4,"And God saw the light, that it was good: and G..."
4,1,Genesis,1001005,1,5,"And God called the light Day, and the darkness..."

### Editing columns in new dataframe

In [64]:
new_column_order = ['id','book','book_name','chapter','verse','text']

df_bible = df_bible[new_column_order]

print('Number of rows: ',df_bible.shape[0])
print('Number of columns: ',df_bible.shape[1])
df_bible.head()

Number of rows:  31103
Number of columns:  6

,id,book,book_name,chapter,verse,text
0,1001001,1,Genesis,1,1,In the beginning God created the heaven and th...
1,1001002,1,Genesis,1,2,"And the earth was without form, and void; and ..."
2,1001003,1,Genesis,1,3,"And God said, Let there be light: and there wa..."
3,1001004,1,Genesis,1,4,"And God saw the light, that it was good: and G..."
4,1001005,1,Genesis,1,5,"And God called the light Day, and the darkness..."

In [65]:
df_bible.to_csv('/Users/owner/Onedrive/Desktop/personal/Data/finished_bible.csv')